Looks good, but need to make sure about the `os_disk_size_gb` as there is no temp storage on D8ps_v5 https://learn.microsoft.com/en-us/azure/virtual-machines/dpsv5-dpdsv5-series but a OS disk of 1023 GiB seems present : https://azureprice.net/vm/Standard_D8ps_v5

```
Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.publicarmpool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "publicarmpool" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "..."
      + max_count             = 10
      + max_pods              = (known after apply)
      + min_count             = 0
      + mode                  = "User"
      + name                  = "pubarmpool"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "repository" = "jenkins-infra/azure"
          + "scope"      = "terraform-managed"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D8ps_v5"
      + vnet_subnet_id        = "..."
      + zones                 = [
          + "3",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```